{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"module_wrapper_6_input": {"name": "module_wrapper_6_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"module_wrapper_11": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_wrapper_6_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/BiasAdd", "op": "_FusedMatMul", "input": ["module_wrapper_6_input", "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/BiasAdd", "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/LeakyRelu", "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/MatMul/ReadVariableOp", "shape": [2, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_6/dense_6/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/MatMul/ReadVariableOp", "shape": [2, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_7/dense_7/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/MatMul/ReadVariableOp", "shape": [62, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_8/dense_8/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/MatMul/ReadVariableOp", "shape": [62, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_9/dense_9/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/MatMul/ReadVariableOp", "shape": [62, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_10/dense_10/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/MatMul/ReadVariableOp", "shape": [62, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/module_wrapper_11/dense_11/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}