{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"dense_42_input": {"name": "dense_42_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"dense_47": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_7/dense_42/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_42/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_43/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_43/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_44/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_44/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_45/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_45/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_46/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "62"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_46/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_47/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_47/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_42_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_42/BiasAdd", "op": "_FusedMatMul", "input": ["dense_42_input", "StatefulPartitionedCall/sequential_7/dense_42/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_42/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_43/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_42/BiasAdd", "StatefulPartitionedCall/sequential_7/dense_43/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_43/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_44/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_43/Relu", "StatefulPartitionedCall/sequential_7/dense_44/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_44/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_45/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_44/Relu", "StatefulPartitionedCall/sequential_7/dense_45/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_45/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_46/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_45/Relu", "StatefulPartitionedCall/sequential_7/dense_46/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_46/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_47/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_46/Relu", "StatefulPartitionedCall/sequential_7/dense_47/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_47/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7/dense_47/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_7/dense_42/MatMul/ReadVariableOp", "shape": [2, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_42/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_43/MatMul/ReadVariableOp", "shape": [2, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_43/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_44/MatMul/ReadVariableOp", "shape": [62, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_44/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_45/MatMul/ReadVariableOp", "shape": [62, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_45/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_46/MatMul/ReadVariableOp", "shape": [62, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_46/BiasAdd/ReadVariableOp", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_47/MatMul/ReadVariableOp", "shape": [62, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_47/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}