{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"module_wrapper_301_input": {"name": "module_wrapper_301_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"module_wrapper_306": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "56"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}, {"size": "56"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "module_wrapper_301_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/BiasAdd", "op": "_FusedMatMul", "input": ["module_wrapper_301_input", "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/BiasAdd", "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/Relu", "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/Relu", "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/Relu", "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/Relu", "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/MatMul/ReadVariableOp", "shape": [2, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_301/dense_301/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/MatMul/ReadVariableOp", "shape": [2, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_302/dense_302/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/MatMul/ReadVariableOp", "shape": [56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_303/dense_303/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/MatMul/ReadVariableOp", "shape": [56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_304/dense_304/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/MatMul/ReadVariableOp", "shape": [56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_305/dense_305/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/MatMul/ReadVariableOp", "shape": [56, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_48/module_wrapper_306/dense_306/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}